-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Ноя 23 2019 г., 23:16
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `animals`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE IF NOT EXISTS `categories` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) NOT NULL,
  `description` text,
  `ordered` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `description`, `ordered`) VALUES
(1, 'Ссавці', NULL, 1),
(2, 'Птахи', NULL, 2),
(3, 'Комахи', NULL, 4),
(4, 'Риби', NULL, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `interestings`
--

CREATE TABLE IF NOT EXISTS `interestings` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `text` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `image` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

--
-- Дамп данных таблицы `interestings`
--

INSERT INTO `interestings` (`id`, `text`, `image`) VALUES
(1, 'Сприйняття запахів у котів приблизно у 14 разів сильніше, ніж у людини, що дозволяє їм відчувати аромати, про які людина навіть не підозрює.', 'cat-1.jpg'),
(2, 'Далеко не всі пінгвіни живуть у полярних широтах. Галапагоські пінгвіни мешкають на однойменних островах, де середньорічна температура становить приблизно +18 градусів за Цельсієм.', 'penguin-1.jpg'),
(3, 'Мурахи виникли з істот, схожих на ос, близько 110-130 мільйонів років тому. Вони жили поруч із динозаврами, але не вимерли, на відміну від цих гігантів.', 'ant-2.jpg'),
(4, 'Крихітні мурахи складають 15-20% від загальної біомаси тварин Землі, перевищуючи масу хребетних.', 'ant-1.jpg'),
(5, 'Для запечатування меду у 75 бджолиних чарунках бджолам необхідно створити один грам воску.', 'bee-3.jpg'),
(6, 'Бджоли збирають мед не заради задоволення — вони піклуються про здорове потомство та його харчування. Щоб прогодувати тисячу личинок, комахи повинні зібрати 100 грамів меду, 50 грамів пилку та 30 грамів води.', 'bee-1.jpg'),
(7, 'Кінь — одна з небагатьох тварин, здатних впізнати себе на фотографії.', 'horse-1.jpg'),
(8, 'Крякання качки не має ехо. Крякати вміють лише самки качок. Селезні крякати не можуть.', 'duck-5.jpg'),
(9, 'Директор притулку для бездомних собак може загнати на дерево директора притулку для бездомних котів.', 'dog-1.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `pages`
--

CREATE TABLE IF NOT EXISTS `pages` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `title` text NOT NULL,
  `description` text,
  `content` text NOT NULL,
  `category` bigint(20) NOT NULL,
  `image` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=9 ;

--
-- Дамп данных таблицы `pages`
--

INSERT INTO `pages` (`id`, `title`, `description`, `content`, `category`, `image`) VALUES
(1, 'Собаки', 'Домашня тварина, друг людини. Собаки століттями жили поруч із людиною, не втомлюючись доводити йому свою відданість та любов.', 'Собака - домашня тварина, одна з найбільш поширених (поряд з кішкою) тварин-компаньйонів. Спочатку домашня собака була виділена в окремий біологічний вид Ліннеєм в 1758 році, в 1993 році рекласифікована Смітсонівським інститутом і Американською асоціацією териолог. У російськомовних письмових джерелах слово «собака» у значенні відповідної тварини зустрічається принаймні з 1475 року, починаючи з грамоти князя Андрія Васильовича Меншого Кирилову монастирю. Собаки відомі своїми здібностями до навчання, любов''ю до гри, соціальною поведінкою. Виведені спеціальні породи собак, призначені для різних цілей: полювання, охорони, потяги гужового транспорту та іншого, а також декоративні породи (наприклад, болонка, пудель).', 1, 'dog.jpg'),
(2, 'Коти', 'Домашня тварина, одна з найбільш популярних (поряд із собакою) «тварин-компаньйонів».', 'Домашня тварина, одна з найбільш популярних (поряд із собакою) «тварин-компаньйонів». З погляду наукової систематики, домашня кішка — ссавець сімейства котячих загону хижих. Раніше домашню кішку часто розглядали як окремий біологічний вигляд. З погляду сучасної біологічної систематики домашня кішка є підвидом лісової кішки. Як одиночний мисливець на гризунів та інших дрібних тварин, кішка — соціальна тварина, яка використовує для спілкування широкий діапазон звукових сигналів, а також феромони та рухи тіла. В даний час у світі налічується близько 600 млн домашніх кішок, виведено близько 200 порід, від довгошерстих (перська кішка) до позбавлених вовни (сфінкси), визнаних та зареєстрованих різними фелінологічними організаціями. Других домашніх шкідників.', 1, 'cat.jpg'),
(3, 'Качки', 'Представник птахів із кількох родів сімейства качиних.', 'Представник птахів з кількох родів сімейства качиних: пеганки, почки, савки, річкові качки, качки-пароходи, мускусні качки та крихали. Усього понад 110 видів. Поширені качки широко, в Росії більше 30 видів. Самці качок називаються селезнями, пташенята качки - каченятами. Качки - це птиці середніх і невеликих розмірів з відносно короткою шиєю і цівкою, покритою. спереду поперечними щитками. Забарвлення оперення різноманітна, у багатьох видів на крилі є спеціальне «дзеркальце». Для ряду видів характерний різко виражений у період розмноження статевий диморфізм, що проявляється найчастіше у різному забарвленні оперення самця та самки. У більшості видів линяння відбувається двічі на рік; літня — повна, осіння — часткова. Домашні качки походять від крякви. Селезні домашніх качок важать 3-4 кг, качки - 2-3,5 кг. Середня річна несучість до 250 яєць. Породи домашніх качок поділяються на м''ясні (пекінські, сірі українські, чорні білогруді), м''ясо-яєчні (дзеркальні, хакі-кемпбел), яєчні (індійські бігуни). Качок розводять у багатьох країнах, у тому числі в Україні.', 2, 'duck.jpg'),
(4, 'Коні', 'Єдиний сучасний рід сімейства кінських загону непарнокопитних.', 'Тварина з сімейства кінських загону непарнокопитних, одомашнений і єдиний підвид дикого коня, що зберігся, вимерла в дикій природі, за винятком невеликої популяції коня Пржевальського. Використовується людиною аж до теперішнього часу. Як показує друга назва сімейства, найбільш характерну особливість його складають ноги, що мають тільки один цілком розвинений і одягнений копитом палець. Череп витягнутий і відрізняється відносно довгою лицьовою частиною. Довгий час коні були серед економічно найважливіших для людини свійських тварин, проте їх важливість впала у зв''язку з розвитком механізації. У природі кінь — житель великих, відкритих просторів степів або прерій, що рятується в разі небезпеки за допомогою втечі. перегородками. На лузі вони також мирно пасуться поруч, оскільки їм потрібні різні види трав: коні воліють соковиті, а кози та вівці колючі. Також вони поїдають траву на різній висоті.', 1, 'horse.jpg'),
(5, 'Бджоли', 'Медоносна комаха, одна з найкорисніших живих істот. Влаштування їх життя є дивовижним явищем у природі.', 'Медоносна комаха, одна з найкорисніших живих істот. Приймає пряму участь у процесі цвітіння та розмноження рослин, збираючи нектар і пилок. Існує близько 21 тисячі видів та 520 пологів бджіл. Їх можна знайти на всіх континентах, крім Антарктиди. Бджоли пристосувалися харчуватися нектаром та пилком, використовуючи нектар головним чином як джерело енергії, а пилок для отримання білків та інших поживних речовин. Мають властивість еусоціальності. У бджіл довгий хоботок, яким вони користуються для висмоктування нектару рослин. У них також є вусики (або антени, сяжки), кожен із яких складається з 13 сегментів у самців і 12 сегментів у самок. Всі бджоли мають дві пари крил, задня пара за розміром менше передньої; тільки в декількох видів у однієї статі або касти крила дуже короткі, що робить політ бджоли важким або неможливим справою. Багато видів бджіл мало вивчені. Розмір бджіл коливається від 2,1 мм у карликової бджоли до 39 мм у виду Megachile pluto, що мешкає в Індонезії.', 3, 'bee.jpg'),
(6, 'Мурахи', 'Одні із найбільш високоорганізованих комах на планеті. Не можуть жити поодинці, а мешкають колоніями до мільйона мешканців.', 'Одні із найбільш високоорганізованих комах на планеті. Їх сім''ї є складні соціальні групи з поділом праці та розвиненими системами комунікації та самоорганізації, що дозволяють особам координувати свої дії при виконанні завдань, які не під силу одному індивіду. Деякі види мурах мають розвинену «мову» і здатні передавати складну інформацію. Крім того, багато видів мурах підтримують високорозвинені симбіотичні відносини з іншими комахами, грибами, бактеріями і рослинами. Мурахи живуть сім''ями в гніздах, званих мурашниками, які влаштовують у ґрунті, деревині, під камінням; деякі споруджують мурашники з дрібних рослинних частинок і т. п. Існують паразитичні види, які мешкають у гніздах інших мурах, мурахи-«рабовласники», що містять у своїх гніздах «рабів» - мурах інших видів. Ряд видів пристосувався до проживання у житлах людини. Деякі види цінуються за регулювання чисельності комах-шкідників, інші можуть вважатися шкідниками. Харчуються переважно соком рослин, паддю попелиць та інших комах, що всмоктують, в період годування личинок — переважно комахами. Є також види, що живляться насінням (мурахи-женці) і культивованими грибами (мурашки-листорези). Поширені по всьому світу, за винятком Антарктиди і деяких віддалених островів, утворюючи 10-25% земної біомаси наземних тварин. Успіх мурах у багатьох середовищах обумовлений їх соціальною організацією та здатністю змінювати місце проживання та використовувати різноманітні ресурси.', 3, 'ant.jpg'),
(7, 'Пінгвіни', 'Єдиний у світі птах, який може плавати, але не може літати.', 'Пінгвіни на сьогоднішній день представляють одне з найчисельніших родин. Це єдині на сьогоднішній день нелітаючі птахи, що входять до загону «Пінгвіноподібні». Вони чудово плавають і пірнають, але зовсім не вміють літати. Форма тіла пінгвінів обтічна, що ідеально для пересування у воді. Мускулатура та влаштування кісток дозволяють їм під водою працювати крилами майже як гвинтами. На відміну від інших птахів, що не літають, пінгвіни мають грудину з чітко вираженим кілем, до якого кріпиться потужна мускулатура. Плавання під водою відрізняється від польоту в повітрі тим, що на підйом крила витрачається та ж енергія, що і на опускання, оскільки опір води більший, ніж опір повітря, тому лопатки пінгвінів мають у порівнянні з іншими птахами велику поверхню, на якій кріпиться мускулатура. відповідальна за підйом крила. Хвіст пінгвінів сильно укорочений, оскільки рульову функцію, яку він зазвичай має в інших водоплавних птахів, у пінгвінів виконують насамперед ноги. Друга явна відмінність пінгвінів від інших птахів – щільність кісток. У всіх птахів кістки трубчасті, що робить їх скелет легшим і дозволяє літати або швидко бігати, а у пінгвінів вони схожі на кістки ссавців (дельфінів і тюленів) і не містять внутрішніх порожнин. Пінгвіни є соціальними тваринами, тому , перебуваючи на суші, вони об''єднуються в групи по кілька десятків або сотень тисяч особин. Колонії бувають настільки численними, що їх видно навіть із космосу.', 2, 'penguin.jpg'),
(8, 'Золоті рибки', 'Вид прісноводних променеперих риб роду карасів.', 'Вид прісноводних променеперих риб роду карасів. Її предок був одомашнений людиною ще VII столітті нашої ери. Є однією з найпопулярніших акваріумних риб і представлена ​​цілою групою порід домашніх акваріумних тварин, отриманої внаслідок багатовікової спрямованої гібридизації та селекції особин з певними випадковими ознаками, що виникли внаслідок мутацій. Одним із застарілих іменувань всіх домашніх і ставкових «золотих рибок» було — «золоті коропи», що походить від загальної наукової систематичної назви — сімейства коропових. Назва групи обумовлена ​​назвою одного з прабатьків усіх порід «золотих рибок»: першої, культивованої зі звичайного срібного карася акваріумної рибки червоно-золотистого кольору з металевим відливом — представника сімейства Карпові, яку велично іменували «золотою рибкою». слова «риби» — рибки), як маленькі та улюблені вихованці: «золоті рибки».', 4, 'goldfish.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `photos`
--

CREATE TABLE IF NOT EXISTS `photos` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `file` varchar(200) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `page` bigint(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=30 ;

--
-- Дамп данных таблицы `photos`
--

INSERT INTO `photos` (`id`, `file`, `page`) VALUES
(1, 'dog-1.jpg', 1),
(2, 'dog-2.jpg', 1),
(3, 'dog-3.jpg', 1),
(4, 'dog-4.jpg', 1),
(5, 'dog-5.jpg', 1),
(6, 'dog-6.jpg', 1),
(7, 'dog-7.jpg', 1),
(8, 'cat-1.jpg', 2),
(9, 'cat-2.jpg', 2),
(10, 'cat-3.jpg', 2),
(11, 'cat-4.jpg', 2),
(12, 'duck-1.jpg', 3),
(13, 'duck-2.jpg', 3),
(14, 'duck-3.jpg', 3),
(15, 'duck-4.jpg', 3),
(16, 'duck-5.jpg', 3),
(17, 'cat-5.jpg', 2),
(18, 'horse-1.jpg', 4),
(19, 'horse-2.jpg', 4),
(20, 'bee-1.jpg', 5),
(21, 'bee-2.jpg', 5),
(22, 'bee-3.jpg', 5),
(23, 'goldfish-1.jpg', 8),
(24, 'goldfish-2.jpg', 8),
(25, 'goldfish-3.jpg', 8),
(26, 'ant-1.jpg', 6),
(27, 'ant-2.jpg', 6),
(28, 'penguin-1.jpg', 7),
(29, 'penguin-2.jpg', 7);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
